<template>
    <!-- Generator: Adobe Illustrator 23.0.0, SVG Export Plug-In . SVG Version: 6.00 Build 0)  -->
    <svg
        version="1.1"
        id="图层_1"
        xmlns="http://www.w3.org/2000/svg"
        xmlns:xlink="http://www.w3.org/1999/xlink"
        x="0px"
        y="0px"
        viewBox="0 0 16 16"
        style="enable-background: new 0 0 16 16"
        xml:space="preserve"
        class="icon"
        fill="currentColor"
    >
        <g>
            <path
                id="路径"
                class="st0"
                d="M14,7.3c0,0.3-0.2,0.5-0.5,0.5c-0.2,0-0.4-0.2-0.5-0.4l0-0.1V3H3v10h4.2c0.2,0,0.4,0.2,0.5,0.4
		l0,0.1c0,0.2-0.2,0.4-0.4,0.5l-0.1,0H2.9c-0.5,0-0.9-0.4-0.9-0.8l0-0.1V2.9C2,2.5,2.4,2.1,2.8,2l0.1,0h10.1c0.5,0,0.9,0.4,0.9,0.8
		l0,0.1V7.3z"
            />
            <path
                id="矩形备份-5"
                class="st1"
                d="M7.5,4C7.2,4,7,4.2,7,4.5c0,0,0,0,0,0l0,7C7,11.8,7.2,12,7.5,12C7.8,12,8,11.8,8,11.5
		c0,0,0,0,0,0l0-7C8,4.2,7.8,4,7.5,4z"
            />
            <path
                id="形状结合"
                class="st0"
                d="M10,5.5c0.6,0,1,0.4,1,1v2c0,0.6-0.4,1-1,1H5c-0.6,0-1-0.4-1-1v-2c0-0.6,0.4-1,1-1H10z
		 M10,6.5H5v2h5V6.5z"
            />
            <path
                class="st1"
                d="M11.9,8.1c0.3-0.1,0.5,0,0.6,0.3l0,0l2.1,5.6c0,0,0,0,0,0l0,0.1c0,0.2-0.1,0.5-0.3,0.5c-0.3,0.1-0.5,0-0.6-0.3
		l0,0L13.2,13L11,13c0,0,0,0,0,0l-0.5,1.4c-0.1,0.3-0.4,0.4-0.6,0.3c-0.3-0.1-0.4-0.4-0.3-0.6c0,0,0,0,0,0l2.1-5.6
		C11.7,8.3,11.8,8.2,11.9,8.1z M12.1,10l-0.7,2h1.5L12.1,10z"
            />
        </g>
    </svg>
</template>
